---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.BendingDetailTypeSegmentLengthDimensionsOffset
source: html/b06c27bd-f25d-1c46-bdcd-59299180b2dd.htm
---
# Autodesk.Revit.DB.ParameterTypeId.BendingDetailTypeSegmentLengthDimensionsOffset Property

"Dimension Offset"

## Syntax (C#)
```csharp
public static ForgeTypeId BendingDetailTypeSegmentLengthDimensionsOffset { get; }
```